<a href="https://colab.research.google.com/github/aditya-nt/TFpublic/blob/master/PandasSQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [6]:
df = pd.read_csv('sample_data/california_housing_train.csv')
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [7]:
df.isna()

       longitude  latitude  ...  median_income  median_house_value
0          False     False  ...          False               False
1          False     False  ...          False               False
2          False     False  ...          False               False
3          False     False  ...          False               False
4          False     False  ...          False               False
...          ...       ...  ...            ...                 ...
16995      False     False  ...          False               False
16996      False     False  ...          False               False
16997      False     False  ...          False               False
16998      False     False  ...          False               False
16999      False     False  ...          False               False

[17000 rows x 9 columns]

In [8]:
df.shape

(17000, 9)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [13]:
df.index

RangeIndex(start=0, stop=17000, step=1)

In [14]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [17]:
df.columns[0]

'longitude'

In [19]:
df.groupby('housing_median_age').head()

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
2844     -117.73     34.06  ...         1.4063             98800.0
2913     -117.76     34.07  ...         2.3156            109800.0
5814     -118.20     34.14  ...         3.9375            217000.0
10993    -120.93     37.65  ...         4.2500            189200.0
13708    -122.00     38.23  ...         5.2636            191300.0

[257 rows x 9 columns]

In [20]:
df.assign(total_income=df['population']*df['median_income']).head(5)

   longitude  latitude  ...  median_house_value  total_income
0    -114.31     34.19  ...             66900.0     1516.0040
1    -114.47     34.40  ...             80100.0     2054.7800
2    -114.56     33.69  ...             85700.0      549.7497
3    -114.57     33.64  ...             73400.0     1643.7255
4    -114.57     33.57  ...             65500.0     1201.2000

[5 rows x 10 columns]

In [0]:
df2=df[['housing_median_age','latitude']]

In [24]:
df2.assign(new = df2['housing_median_age']*2).head(5)

   housing_median_age  latitude   new
0                15.0     34.19  30.0
1                19.0     34.40  38.0
2                17.0     33.69  34.0
3                14.0     33.64  28.0
4                20.0     33.57  40.0

In [25]:
df2[df2['housing_median_age']==15.0].head()

    housing_median_age  latitude
0                 15.0     34.19
14                15.0     32.76
23                15.0     33.82
38                15.0     32.68
79                15.0     32.80

In [28]:
df[['households','housing_median_age']].head()

   households  housing_median_age
0       472.0                15.0
1       463.0                19.0
2       117.0                17.0
3       226.0                14.0
4       262.0                20.0

In [33]:
df[['households','housing_median_age']].groupby('housing_median_age').tail()

       households  housing_median_age
10993       112.0                 1.0
13152       990.0                 3.0
13350       456.0                 3.0
13486      1215.0                 3.0
13708       268.0                 1.0
...           ...                 ...
16995       369.0                52.0
16996       465.0                36.0
16997       456.0                17.0
16998       478.0                19.0
16999       270.0                52.0

[257 rows x 2 columns]